// Script js
// Створиму константу url значенням якої буде адреса сторінки яку необхідно перевірити 
const url = 'https://rozetka.com.ua/ua/';
// Створимо константу search_text і присовїмо їй знчення тексту який необхідно знайти

const search_text = 'Доставка по всій Україні';
/* 
 За допомогою функції fetch() що повертає  об'єкт Promise який
 представляє асинхронний результат операції отримання ресурсу.
 Методом .then() викликається для обробки результату виконання функції fetch(). При успішному виконанні, об'єкт відповіді (response) перетворюється у текстовий формат викликом методу .text().
 Наступний метод .then() викликається для обробки отриманого тексту (page_content). Перевіряєм, чи містить отриманий текст шуканий текст search_text за допомогою методу .includes(). 
 Якщо під час виконання будь-якої з цих операцій сталася помилка, викликається метод .catch() для обробки помилки і виводу повідомлення про помилку 'Сталася помилка:', разом повідомленням про помилку (error).
*/

fetch(url)
  .then(response => response.text())
  .then(page_content => {
    if (page_content.includes(search_text)) {
      console.log('Текст знайдено на сторінці.');
    } else {
      console.log('Текст не знайдено на сторінці.');
    }
  })
  .catch(error => console.log('Сталася помилка:', error));